ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
<module name="MSS_RCM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MSS_RCM_R5SS0_RST_STATUS" acronym="MSS_RCM_R5SS0_RST_STATUS" offset="16" width="32" description="R5SS Reset Cause Status register of corresponding R5SS.">
		<bitfield id="R5SS0_RST_STATUS_CAUSE" width="11" begin="10" end="0" resetval="0x3" description="Has the status because of which reset has happened.  Bit0: POR ResetBit1: Warm Reset [ALso set during POR Reset]Bit2: CR5SS0 STC ResetBit3  Reset for CORE0 and MSS_CORE00_VIM  using MSS_RCM::MSS_CR5SSA0_RST_CTRLBit4: Reset for CORE1 and MSS_CORE10_VIM using MSS_RCM::MSS_CR5SSB0_RST_CTRLBit5: Reset for  CORE0 only using  MSS_RCM::MSS_CORE00_RST_CTRLBit6: Reset for CORE1 only using using MSS_RCM::MSS_CORE10_RST_CTRLBit7: Reset for CORE0 and MSS_CORE00_VIM caused because of reset request  by debugger in CORE00                                                                                                       Bit8:  Reset for CORE10 and MSS_CORE10_VIM caused because of reset request  by debugger in CORE10Bit9: Reset for CR5SS0 by the RESET FSM  using MSS_CTRL::R5SS0_CONTROL_RESET_FSM_TRIGGER        Bit10 : Reset for CR5SS0 using MSS_RCM.R5SS0_POR_RST_CTRL" range="10:0" rwaccess="R"/>
	</register><register id="MSS_RCM_R5SS0_RST_CAUSE_CLR" acronym="MSS_RCM_R5SS0_RST_CAUSE_CLR" offset="20" width="32" description="R5SS Reset Cause Clear register of corresponding R5SS.">
		<bitfield id="R5SS0_RST_CAUSE_CLR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Clear bit for rst cause register [Writing 3'b111  will clear the rst cause register]" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_DBG_RST_EN" acronym="MSS_RCM_R5SS0_DBG_RST_EN" offset="24" width="32" description="This register enables Core debug reset request  to propogate to RCM.">
		<bitfield id="R5SS0_DBG_RST_EN_EN_CORE1" width="3" begin="18" end="16" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE1  toggling reset for CORE1 of respective R5SS" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS0_DBG_RST_EN_EN_CORE0" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE0  toggling reset for CORE0 of respective R5SS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_RST_ASSERDLY" acronym="MSS_RCM_R5SS0_RST_ASSERDLY" offset="28" width="32" description="This register controls the reset duration of the corrseponding R5SS.">
		<bitfield id="R5SS0_RST_ASSERDLY_COMMON" width="8" begin="7" end="0" resetval="0x15" description="Value decides number of cycles reset should be kept asserted for CR5SS related resets. Programming a value of 0xFF will keep the reset asserted untill a new value other than 0xFF is written to this registerThe actual duration is count + 2 cycles. S/W Recommended value for this is 0x0FThe COUNT is applicable to both CPU cores" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_RST2ASSERTDLY" acronym="MSS_RCM_R5SS0_RST2ASSERTDLY" offset="32" width="32" description="This register controls the delay of Reset assertion to the corresponding R5SS.">
		<bitfield id="R5SS0_RST2ASSERTDLY_R5_CORE1_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE1" range="31:24" rwaccess="R/W"/>
	<bitfield id="R5SS0_RST2ASSERTDLY_R5_CORE0_COUNT" width="8" begin="23" end="16" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE0." range="23:16" rwaccess="R/W"/>
	<bitfield id="R5SS0_RST2ASSERTDLY_R5SS_CORE1_COUNT" width="8" begin="15" end="8" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE1" range="15:8" rwaccess="R/W"/>
	<bitfield id="R5SS0_RST2ASSERTDLY_R5SS_CORE0_COUNT" width="8" begin="7" end="0" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE0." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_RST_WFICHECK" acronym="MSS_RCM_R5SS0_RST_WFICHECK" offset="36" width="32" description="Enable WFI ceck before R5 Reset is asserted.">
		<bitfield id="R5SS0_RST_WFICHECK_EN_R5_CORE1" width="3" begin="26" end="24" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of CORE0" range="26:24" rwaccess="R/W"/>
	<bitfield id="R5SS0_RST_WFICHECK_R5A" width="3" begin="18" end="16" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of CORE0" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS0_RST_WFICHECK_EN_R5SS_CORE1" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of CORE1" range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS0_RST_WFICHECK_EN_R5SS_CORE0" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of CORE0" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_RST_STATUS" acronym="MSS_RCM_R5SS1_RST_STATUS" offset="48" width="32" description="R5SS Reset Cause Status register of corresponding R5SS.">
		<bitfield id="R5SS1_RST_STATUS_CAUSE" width="11" begin="10" end="0" resetval="0x3" description="Has the status because of which reset has happened.  Bit0: POR ResetBit1: Warm Reset [ALso set during POR Reset]Bit2: CR5SS1 STC ResetBit3  Reset for CORE0 and MSS_CORE00_VIM  using MSS_RCM::MSS_CR5SSA0_RST_CTRLBit4: Reset for CORE1 and MSS_CORE10_VIM using MSS_RCM::MSS_CR5SSB0_RST_CTRLBit5: Reset for  CORE0 only using  MSS_RCM::MSS_CORE00_RST_CTRLBit6: Reset for CORE1 only using using MSS_RCM::MSS_CORE10_RST_CTRLBit7: Reset for CORE0 and MSS_CORE00_VIM caused because of reset request  by debugger in CORE00                                                                                                       Bit8:  Reset for CORE10 and MSS_CORE10_VIM caused because of reset request  by debugger in CORE10Bit9: Reset for CR5SS0 by the RESET FSM  using MSS_CTRL::R5SS0_CONTROL_RESET_FSM_TRIGGER        Bit10 : Reset for CR5SS1 using MSS_RCM.R5SS0_POR_RST_CTRL" range="10:0" rwaccess="R"/>
	</register><register id="MSS_RCM_R5SS1_RST_CAUSE_CLR" acronym="MSS_RCM_R5SS1_RST_CAUSE_CLR" offset="52" width="32" description="R5SS Reset Cause Clear register of corresponding R5SS.">
		<bitfield id="R5SS1_RST_CAUSE_CLR_CLR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Clear bit for rst cause register [Writing 3'b111  will clear the rst cause register]" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_DBG_RST_EN" acronym="MSS_RCM_R5SS1_DBG_RST_EN" offset="56" width="32" description="This register enables Core debug reset request  to propogate to RCM.">
		<bitfield id="R5SS1_DBG_RST_EN_EN_CORE1" width="3" begin="18" end="16" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE1  toggling reset for CORE1 of respective R5SS" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS1_DBG_RST_EN_EN_CORE0" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111   will block debug reset request from CORE0  toggling reset for CORE0 of respective R5SS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_RST_ASSERDLY" acronym="MSS_RCM_R5SS1_RST_ASSERDLY" offset="60" width="32" description="This register controls the reset duration of the corrseponding R5SS.">
		<bitfield id="R5SS1_RST_ASSERDLY_COMMON" width="8" begin="7" end="0" resetval="0x15" description="Value decides number of cycles reset should be kept asserted for CR5SS related resets. Programming a value of 0xFF will keep the reset asserted untill a new value other than 0xFF is written to this registerThe actual duration is count + 2 cycles. S/W Recommended value for this is 0x0FThe COUNT is applicable to both CPU cores" range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_RST2ASSERTDLY" acronym="MSS_RCM_R5SS1_RST2ASSERTDLY" offset="64" width="32" description="This register controls the delay of Reset assertion to the corresponding R5SS.">
		<bitfield id="R5SS1_RST2ASSERTDLY_R5_CORE1_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE1" range="31:24" rwaccess="R/W"/>
	<bitfield id="R5SS1_RST2ASSERTDLY_R5_CORE0_COUNT" width="8" begin="23" end="16" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE0." range="23:16" rwaccess="R/W"/>
	<bitfield id="R5SS1_RST2ASSERTDLY_R5SS_CORE1_COUNT" width="8" begin="15" end="8" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE1" range="15:8" rwaccess="R/W"/>
	<bitfield id="R5SS1_RST2ASSERTDLY_R5SS_CORE0_COUNT" width="8" begin="7" end="0" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE0." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_RST_WFICHECK" acronym="MSS_RCM_R5SS1_RST_WFICHECK" offset="68" width="32" description="Enable WFI ceck before R5 Reset is asserted.">
		<bitfield id="R5SS1_RST_WFICHECK_EN_R5_CORE1" width="3" begin="26" end="24" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of CORE0" range="26:24" rwaccess="R/W"/>
	<bitfield id="R5SS1_RST_WFICHECK_R5A" width="3" begin="18" end="16" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  local reset assertion of CORE0" range="18:16" rwaccess="R/W"/>
	<bitfield id="R5SS1_RST_WFICHECK_EN_R5SS_CORE1" width="3" begin="10" end="8" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of CORE1" range="10:8" rwaccess="R/W"/>
	<bitfield id="R5SS1_RST_WFICHECK_EN_R5SS_CORE0" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b000 will disable check for WFI before  global reset assertion of CORE0" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CPSW_5_50_250_CLK_MUX_CTRL" acronym="MSS_RCM_CPSW_5_50_250_CLK_MUX_CTRL" offset="128" width="32" description="CPSW CLK MUX CTRL to select DPLL_PER_HSDIV0_CLKOUT1 or  DPLL_CORE_HSDIV0_CLKOUT1.">
		<bitfield id="CPSW_5_50_250_CLK_MUX_CTRL_CLKSRCSEL" width="3" begin="2" end="0" resetval="0x0" description="CPSW CLK MUX CTRL to select DPLL_PER_HSDIV0_CLKOUT1 or DPLL_CORE_HSDIV0_CLKOUT13'b000: DPLL_CORE_HSDIV0_CLKOUT1 [default]3'b111:    DPLL_PER_HSDIV0_CLKOUT1**Note: The input clocks to the mux should be disabled when the mux select toggles." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN0_CLK_SRC_SEL" acronym="MSS_RCM_MCAN0_CLK_SRC_SEL" offset="256" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN1_CLK_SRC_SEL" acronym="MSS_RCM_MCAN1_CLK_SRC_SEL" offset="260" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN2_CLK_SRC_SEL" acronym="MSS_RCM_MCAN2_CLK_SRC_SEL" offset="264" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN3_CLK_SRC_SEL" acronym="MSS_RCM_MCAN3_CLK_SRC_SEL" offset="268" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_OSPI0_CLK_SRC_SEL" acronym="MSS_RCM_OSPI0_CLK_SRC_SEL" offset="272" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="OSPI0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for OSPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  DPLL_CORE_HSDIV0_CLKOUT30x777 -  DPLL_PER_HSDIV0_CLKOUT2" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI0_CLK_SRC_SEL" acronym="MSS_RCM_RTI0_CLK_SRC_SEL" offset="276" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI1_CLK_SRC_SEL" acronym="MSS_RCM_RTI1_CLK_SRC_SEL" offset="280" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI2_CLK_SRC_SEL" acronym="MSS_RCM_RTI2_CLK_SRC_SEL" offset="284" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI3_CLK_SRC_SEL" acronym="MSS_RCM_RTI3_CLK_SRC_SEL" offset="288" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT0_CLK_SRC_SEL" acronym="MSS_RCM_WDT0_CLK_SRC_SEL" offset="296" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="WDT0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT1_CLK_SRC_SEL" acronym="MSS_RCM_WDT1_CLK_SRC_SEL" offset="300" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="WDT1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT2_CLK_SRC_SEL" acronym="MSS_RCM_WDT2_CLK_SRC_SEL" offset="304" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="WDT2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT3_CLK_SRC_SEL" acronym="MSS_RCM_WDT3_CLK_SRC_SEL" offset="308" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="WDT3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  RCCLK10M0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI0_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI0_CLK_SRC_SEL" offset="316" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI1_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI1_CLK_SRC_SEL" offset="320" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI2_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI2_CLK_SRC_SEL" offset="324" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI3_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI3_CLK_SRC_SEL" offset="328" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI4_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI4_CLK_SRC_SEL" offset="332" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
