ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="MCSPI4_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MMC0_CLK_SRC_SEL" acronym="MSS_RCM_MMC0_CLK_SRC_SEL" offset="336" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MMC0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MMCSD.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS0_UART0_CLK_SRC_SEL" acronym="MSS_RCM_PRU_ICSS0_UART0_CLK_SRC_SEL" offset="340" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="PRU_ICSS0_UART0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for ICSSM_UCLK.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CPTS_CLK_SRC_SEL" acronym="MSS_RCM_CPTS_CLK_SRC_SEL" offset="344" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="CPTS_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for CPTS.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_SRC_SEL" acronym="MSS_RCM_CONTROLSS_PLL_CLK_SRC_SEL" offset="352" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="CONTROLSS_PLL_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for CONTROLSS_PLL.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  DPLL_CORE_HSDIV0_CLKOUT20x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C_CLK_SRC_SEL" acronym="MSS_RCM_I2C_CLK_SRC_SEL" offset="356" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="I2C_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for I2C.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN0_UART0_CLK_SRC_SEL" acronym="MSS_RCM_LIN0_UART0_CLK_SRC_SEL" offset="372" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="LIN0_UART0_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN1_UART1_CLK_SRC_SEL" acronym="MSS_RCM_LIN1_UART1_CLK_SRC_SEL" offset="376" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="LIN1_UART1_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN2_UART2_CLK_SRC_SEL" acronym="MSS_RCM_LIN2_UART2_CLK_SRC_SEL" offset="380" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="LIN2_UART2_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN3_UART3_CLK_SRC_SEL" acronym="MSS_RCM_LIN3_UART3_CLK_SRC_SEL" offset="384" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="LIN3_UART3_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN4_UART4_CLK_SRC_SEL" acronym="MSS_RCM_LIN4_UART4_CLK_SRC_SEL" offset="388" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="LIN4_UART4_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN5_UART5_CLK_SRC_SEL" acronym="MSS_RCM_LIN5_UART5_CLK_SRC_SEL" offset="392" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="LIN5_UART5_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  DPLL_PER_HSDIV0_CLKOUT0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN4_CLK_SRC_SEL" acronym="MSS_RCM_MCAN4_CLK_SRC_SEL" offset="396" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN4_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN5_CLK_SRC_SEL" acronym="MSS_RCM_MCAN5_CLK_SRC_SEL" offset="400" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN5_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN6_CLK_SRC_SEL" acronym="MSS_RCM_MCAN6_CLK_SRC_SEL" offset="404" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN6_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN7_CLK_SRC_SEL" acronym="MSS_RCM_MCAN7_CLK_SRC_SEL" offset="408" width="32" description="Clock Source selection Register for corresponding Root clock.">
		<bitfield id="MCAN7_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values for selecting clock source-0x000 - WUCPUCLK0x111 - EXT_REFCLK0x222 - SYS_CLK0x333 - DPLL_PER_HSDIV0_CLKOUT10x444 - DPLL_CORE_HSDIV0_CLKOUT00x555 - RCCLK10M0x666 - XTALCLK0x777 - RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI4_CLK_SRC_SEL" acronym="MSS_RCM_RTI4_CLK_SRC_SEL" offset="412" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI4_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI5_CLK_SRC_SEL" acronym="MSS_RCM_RTI5_CLK_SRC_SEL" offset="416" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI5_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI6_CLK_SRC_SEL" acronym="MSS_RCM_RTI6_CLK_SRC_SEL" offset="420" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI6_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI7_CLK_SRC_SEL" acronym="MSS_RCM_RTI7_CLK_SRC_SEL" offset="424" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="RTI7_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register. Use the following values to select clk src-      0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  CTPS_GENF0" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI5_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI5_CLK_SRC_SEL" offset="428" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI5_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI6_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI6_CLK_SRC_SEL" offset="432" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI6_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI7_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI7_CLK_SRC_SEL" offset="436" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="MCSPI7_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  EXT_REFCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  DPLL_CORE_HSDIV0_CLKOUT00x555 -  RCCLK10M0x666 -  XTALCLK0x777 -  RCCLK10M" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN0_CLK_DIV_VAL" acronym="MSS_RCM_MCAN0_CLK_DIV_VAL" offset="512" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN1_CLK_DIV_VAL" acronym="MSS_RCM_MCAN1_CLK_DIV_VAL" offset="516" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN2_CLK_DIV_VAL" acronym="MSS_RCM_MCAN2_CLK_DIV_VAL" offset="520" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN3_CLK_DIV_VAL" acronym="MSS_RCM_MCAN3_CLK_DIV_VAL" offset="524" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_OSPI0_CLK_DIV_VAL" acronym="MSS_RCM_OSPI0_CLK_DIV_VAL" offset="528" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="OSPI0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value OSPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI0_CLK_DIV_VAL" acronym="MSS_RCM_RTI0_CLK_DIV_VAL" offset="532" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI1_CLK_DIV_VAL" acronym="MSS_RCM_RTI1_CLK_DIV_VAL" offset="536" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI2_CLK_DIV_VAL" acronym="MSS_RCM_RTI2_CLK_DIV_VAL" offset="540" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI3_CLK_DIV_VAL" acronym="MSS_RCM_RTI3_CLK_DIV_VAL" offset="544" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT0_CLK_DIV_VAL" acronym="MSS_RCM_WDT0_CLK_DIV_VAL" offset="552" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="WDT0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT1_CLK_DIV_VAL" acronym="MSS_RCM_WDT1_CLK_DIV_VAL" offset="556" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="WDT1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT2_CLK_DIV_VAL" acronym="MSS_RCM_WDT2_CLK_DIV_VAL" offset="560" width="32" description="This Register is used to select the Divider value for respective clk.">
