ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="WDT2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT3_CLK_DIV_VAL" acronym="MSS_RCM_WDT3_CLK_DIV_VAL" offset="564" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="WDT3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI0_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI0_CLK_DIV_VAL" offset="572" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI1_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI1_CLK_DIV_VAL" offset="576" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI2_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI2_CLK_DIV_VAL" offset="580" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI3_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI3_CLK_DIV_VAL" offset="584" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI4_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI4_CLK_DIV_VAL" offset="588" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI4_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MMC0_CLK_DIV_VAL" acronym="MSS_RCM_MMC0_CLK_DIV_VAL" offset="592" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MMC0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value MMCSD selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS0_UART_CLK_DIV_VAL" acronym="MSS_RCM_PRU_ICSS0_UART_CLK_DIV_VAL" offset="596" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="PRU_ICSS0_UART_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value ICSSM_UCLK selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CPTS_CLK_DIV_VAL" acronym="MSS_RCM_CPTS_CLK_DIV_VAL" offset="600" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="CPTS_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value CPTS selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_DIV_VAL" acronym="MSS_RCM_CONTROLSS_PLL_CLK_DIV_VAL" offset="608" width="32" description="CONTROLSS_PLL_CLK Divider Value for Control subsystem.">
		<bitfield id="CONTROLSS_PLL_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value CONTROLSS_PLL selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C_CLK_DIV_VAL" acronym="MSS_RCM_I2C_CLK_DIV_VAL" offset="612" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="I2C_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value I2C selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN0_UART0_CLK_DIV_VAL" acronym="MSS_RCM_LIN0_UART0_CLK_DIV_VAL" offset="628" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="LIN0_UART0_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN1_UART1_CLK_DIV_VAL" acronym="MSS_RCM_LIN1_UART1_CLK_DIV_VAL" offset="632" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="LIN1_UART1_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN2_UART2_CLK_DIV_VAL" acronym="MSS_RCM_LIN2_UART2_CLK_DIV_VAL" offset="636" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="LIN2_UART2_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN3_UART3_CLK_DIV_VAL" acronym="MSS_RCM_LIN3_UART3_CLK_DIV_VAL" offset="640" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="LIN3_UART3_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN4_UART4_CLK_DIV_VAL" acronym="MSS_RCM_LIN4_UART4_CLK_DIV_VAL" offset="644" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="LIN4_UART4_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN5_UART5_CLK_DIV_VAL" acronym="MSS_RCM_LIN5_UART5_CLK_DIV_VAL" offset="648" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="LIN5_UART5_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RGMII_250_CLK_DIV_VAL" acronym="MSS_RCM_RGMII_250_CLK_DIV_VAL" offset="652" width="32" description="RGMII 250 CLK Divider Value.">
		<bitfield id="RGMII_250_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x273" description="Divider value RGMII selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RGMII_50_CLK_DIV_VAL" acronym="MSS_RCM_RGMII_50_CLK_DIV_VAL" offset="656" width="32" description="RGMII 50 CLK Divider Value.">
		<bitfield id="RGMII_50_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x2457" description="Divider value MII100 selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RGMII_5_CLK_DIV_VAL" acronym="MSS_RCM_RGMII_5_CLK_DIV_VAL" offset="660" width="32" description="RGMII 5 CLK Divider Value.">
		<bitfield id="RGMII_5_CLK_DIV_VAL_CLKDIVR" width="24" begin="23" end="0" resetval="0x6513507" description="Divider value MII10 selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x15' is required then '0x151515' should be configured to the register." range="23:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_XTAL_MMC_32K_CLK_DIV_VAL" acronym="MSS_RCM_XTAL_MMC_32K_CLK_DIV_VAL" offset="664" width="32" description="XTAL 32K CLK Divider Value for MMC.">
		<bitfield id="XTAL_MMC_32K_CLK_DIV_VAL_CLKDIVR" width="30" begin="29" end="0" resetval="0x818688780" description="Divider value for XTAL_32K clock. To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit. For example: if divider value of '0x30C' is required then register should be configured as follows -bits[9:0] = 0x30Cbits[19:10] = 0x30Cbits[29:20] = 0x30CThis configures the register to 0x30CC330C" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_XTAL_TEMPSENSE_32K_CLK_DIV_VAL" acronym="MSS_RCM_XTAL_TEMPSENSE_32K_CLK_DIV_VAL" offset="668" width="32" description="XTAL 32K CLK Divider Value for Temp Sensor.">
		<bitfield id="XTAL_TEMPSENSE_32K_CLK_DIV_VAL_CLKDIVR" width="30" begin="29" end="0" resetval="0x818688780" description="Divider value for XTAL_32K clock. To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit. For example: if divider value of '0x30C' is required then register should be configured as follows -bits[9:0] = 0x30Cbits[19:10] = 0x30Cbits[29:20] = 0x30CThis configures the register to 0x30CC330C" range="29:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN4_CLK_DIV_VAL" acronym="MSS_RCM_MCAN4_CLK_DIV_VAL" offset="676" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN4_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN5_CLK_DIV_VAL" acronym="MSS_RCM_MCAN5_CLK_DIV_VAL" offset="680" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN5_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN6_CLK_DIV_VAL" acronym="MSS_RCM_MCAN6_CLK_DIV_VAL" offset="684" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN6_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN7_CLK_DIV_VAL" acronym="MSS_RCM_MCAN7_CLK_DIV_VAL" offset="688" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCAN7_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI4_CLK_DIV_VAL" acronym="MSS_RCM_RTI4_CLK_DIV_VAL" offset="692" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI4_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI5_CLK_DIV_VAL" acronym="MSS_RCM_RTI5_CLK_DIV_VAL" offset="696" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI5_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI6_CLK_DIV_VAL" acronym="MSS_RCM_RTI6_CLK_DIV_VAL" offset="700" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI6_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI7_CLK_DIV_VAL" acronym="MSS_RCM_RTI7_CLK_DIV_VAL" offset="704" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="RTI7_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI5_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI5_CLK_DIV_VAL" offset="708" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI5_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI6_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI6_CLK_DIV_VAL" offset="712" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI6_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI7_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI7_CLK_DIV_VAL" offset="716" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="MCSPI7_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN0_CLK_GATE" acronym="MSS_RCM_MCAN0_CLK_GATE" offset="768" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCAN0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN1_CLK_GATE" acronym="MSS_RCM_MCAN1_CLK_GATE" offset="772" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCAN1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN2_CLK_GATE" acronym="MSS_RCM_MCAN2_CLK_GATE" offset="776" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCAN2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN3_CLK_GATE" acronym="MSS_RCM_MCAN3_CLK_GATE" offset="780" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCAN3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_OSPI0_CLK_GATE" acronym="MSS_RCM_OSPI0_CLK_GATE" offset="784" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="OSPI0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for OSPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI0_CLK_GATE" acronym="MSS_RCM_RTI0_CLK_GATE" offset="788" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI1_CLK_GATE" acronym="MSS_RCM_RTI1_CLK_GATE" offset="792" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI2_CLK_GATE" acronym="MSS_RCM_RTI2_CLK_GATE" offset="796" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI3_CLK_GATE" acronym="MSS_RCM_RTI3_CLK_GATE" offset="800" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT0_CLK_GATE" acronym="MSS_RCM_WDT0_CLK_GATE" offset="808" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="WDT0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT1_CLK_GATE" acronym="MSS_RCM_WDT1_CLK_GATE" offset="812" width="32" description="This Register is used to enable clk gating for the respective clk.">
