ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="WDT1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT2_CLK_GATE" acronym="MSS_RCM_WDT2_CLK_GATE" offset="816" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="WDT2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT3_CLK_GATE" acronym="MSS_RCM_WDT3_CLK_GATE" offset="820" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="WDT3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI0_CLK_GATE" acronym="MSS_RCM_MCSPI0_CLK_GATE" offset="828" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI1_CLK_GATE" acronym="MSS_RCM_MCSPI1_CLK_GATE" offset="832" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI2_CLK_GATE" acronym="MSS_RCM_MCSPI2_CLK_GATE" offset="836" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI3_CLK_GATE" acronym="MSS_RCM_MCSPI3_CLK_GATE" offset="840" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI4_CLK_GATE" acronym="MSS_RCM_MCSPI4_CLK_GATE" offset="844" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MMC0_CLK_GATE" acronym="MSS_RCM_MMC0_CLK_GATE" offset="848" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MMC0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MMCSD" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS0_UART_CLK_GATE" acronym="MSS_RCM_PRU_ICSS0_UART_CLK_GATE" offset="852" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="PRU_ICSS0_UART_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_UCLK" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CPTS_CLK_GATE" acronym="MSS_RCM_CPTS_CLK_GATE" offset="856" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="CPTS_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for CPTS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_GATE" acronym="MSS_RCM_CONTROLSS_PLL_CLK_GATE" offset="864" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="CONTROLSS_PLL_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for CONTROLSS_PLL" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C0_CLK_GATE" acronym="MSS_RCM_I2C0_CLK_GATE" offset="868" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="I2C0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C1_CLK_GATE" acronym="MSS_RCM_I2C1_CLK_GATE" offset="872" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="I2C1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C2_CLK_GATE" acronym="MSS_RCM_I2C2_CLK_GATE" offset="876" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="I2C2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C3_CLK_GATE" acronym="MSS_RCM_I2C3_CLK_GATE" offset="880" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="I2C3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN0_CLK_GATE" acronym="MSS_RCM_LIN0_CLK_GATE" offset="884" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="LIN0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for SPIB" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN1_CLK_GATE" acronym="MSS_RCM_LIN1_CLK_GATE" offset="888" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="LIN1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for SPIB" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN2_CLK_GATE" acronym="MSS_RCM_LIN2_CLK_GATE" offset="892" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="LIN2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for SPIB" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN3_CLK_GATE" acronym="MSS_RCM_LIN3_CLK_GATE" offset="896" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="LIN3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for SPIB" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN4_CLK_GATE" acronym="MSS_RCM_LIN4_CLK_GATE" offset="900" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="LIN4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for SPIB" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART0_CLK_GATE" acronym="MSS_RCM_UART0_CLK_GATE" offset="908" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="UART0_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART1_CLK_GATE" acronym="MSS_RCM_UART1_CLK_GATE" offset="912" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="UART1_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART2_CLK_GATE" acronym="MSS_RCM_UART2_CLK_GATE" offset="916" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="UART2_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART3_CLK_GATE" acronym="MSS_RCM_UART3_CLK_GATE" offset="920" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="UART3_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART4_CLK_GATE" acronym="MSS_RCM_UART4_CLK_GATE" offset="924" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="UART4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART5_CLK_GATE" acronym="MSS_RCM_UART5_CLK_GATE" offset="928" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="UART5_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding UART" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RGMII_250_CLK_GATE" acronym="MSS_RCM_RGMII_250_CLK_GATE" offset="932" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RGMII_250_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for RGMII" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RGMII_50_CLK_GATE" acronym="MSS_RCM_RGMII_50_CLK_GATE" offset="936" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RGMII_50_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MII100" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RGMII_5_CLK_GATE" acronym="MSS_RCM_RGMII_5_CLK_GATE" offset="940" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RGMII_5_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MII10" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MMC0_32K_CLK_GATE" acronym="MSS_RCM_MMC0_32K_CLK_GATE" offset="944" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MMC0_32K_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for MMCSD_32K" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_TEMPSENSE_32K_CLK_GATE" acronym="MSS_RCM_TEMPSENSE_32K_CLK_GATE" offset="948" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="TEMPSENSE_32K_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for TEMPSENSE_32K" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CPSW_CLK_GATE" acronym="MSS_RCM_CPSW_CLK_GATE" offset="952" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="CPSW_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for CPSW CPPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS0_IEP_CLK_GATE" acronym="MSS_RCM_PRU_ICSS0_IEP_CLK_GATE" offset="956" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="PRU_ICSS0_IEP_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_IEP" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS0_CORE_CLK_GATE" acronym="MSS_RCM_PRU_ICSS0_CORE_CLK_GATE" offset="960" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="PRU_ICSS0_CORE_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_CORE" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_PRU_ICSS_SYS_CLK_GATE" acronym="MSS_RCM_MSS_PRU_ICSS_SYS_CLK_GATE" offset="964" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_PRU_ICSS_SYS_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for ICSSM_SYS" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_CORE0_GATE" acronym="MSS_RCM_R5SS0_CORE0_GATE" offset="972" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5SS0_CORE0_GATE_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE0 related peripherals inside Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_CORE0_GATE" acronym="MSS_RCM_R5SS1_CORE0_GATE" offset="976" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5SS1_CORE0_GATE_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE0 related peripherals inside Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_CORE1_GATE" acronym="MSS_RCM_R5SS0_CORE1_GATE" offset="980" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5SS0_CORE1_GATE_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE1 related peripherals inside Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_CORE1_GATE" acronym="MSS_RCM_R5SS1_CORE1_GATE" offset="984" width="32" description="Clock gating for individual CPU core. ">
		<bitfield id="R5SS1_CORE1_GATE_CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock to CORE1 related peripherals inside Cortexr5ss" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN4_CLK_GATE" acronym="MSS_RCM_MSS_MCAN4_CLK_GATE" offset="988" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN5_CLK_GATE" acronym="MSS_RCM_MSS_MCAN5_CLK_GATE" offset="992" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN5_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN6_CLK_GATE" acronym="MSS_RCM_MSS_MCAN6_CLK_GATE" offset="996" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN6_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_MCAN7_CLK_GATE" acronym="MSS_RCM_MSS_MCAN7_CLK_GATE" offset="1000" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MSS_MCAN7_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI4_CLK_GATE" acronym="MSS_RCM_RTI4_CLK_GATE" offset="1004" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI4_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI5_CLK_GATE" acronym="MSS_RCM_RTI5_CLK_GATE" offset="1008" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI5_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI6_CLK_GATE" acronym="MSS_RCM_RTI6_CLK_GATE" offset="1012" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI6_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI7_CLK_GATE" acronym="MSS_RCM_RTI7_CLK_GATE" offset="1016" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="RTI7_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN0_CLK_STATUS" acronym="MSS_RCM_MCAN0_CLK_STATUS" offset="1024" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN1_CLK_STATUS" acronym="MSS_RCM_MCAN1_CLK_STATUS" offset="1028" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN2_CLK_STATUS" acronym="MSS_RCM_MCAN2_CLK_STATUS" offset="1032" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN3_CLK_STATUS" acronym="MSS_RCM_MCAN3_CLK_STATUS" offset="1036" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_OSPI0_CLK_STATUS" acronym="MSS_RCM_OSPI0_CLK_STATUS" offset="1040" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="OSPI0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for OSPI" range="15:8" rwaccess="R"/>
	<bitfield id="OSPI0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for OSPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI0_CLK_STATUS" acronym="MSS_RCM_RTI0_CLK_STATUS" offset="1044" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI1_CLK_STATUS" acronym="MSS_RCM_RTI1_CLK_STATUS" offset="1048" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI2_CLK_STATUS" acronym="MSS_RCM_RTI2_CLK_STATUS" offset="1052" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI3_CLK_STATUS" acronym="MSS_RCM_RTI3_CLK_STATUS" offset="1056" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_WDT0_CLK_STATUS" acronym="MSS_RCM_WDT0_CLK_STATUS" offset="1064" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="WDT0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15:8" rwaccess="R"/>
	<bitfield id="WDT0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_WDT1_CLK_STATUS" acronym="MSS_RCM_WDT1_CLK_STATUS" offset="1068" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="WDT1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15:8" rwaccess="R"/>
