ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
	<bitfield id="WDT1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_WDT2_CLK_STATUS" acronym="MSS_RCM_WDT2_CLK_STATUS" offset="1072" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="WDT2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15:8" rwaccess="R"/>
	<bitfield id="WDT2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_WDT3_CLK_STATUS" acronym="MSS_RCM_WDT3_CLK_STATUS" offset="1076" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="WDT3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15:8" rwaccess="R"/>
	<bitfield id="WDT3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI0_CLK_STATUS" acronym="MSS_RCM_MCSPI0_CLK_STATUS" offset="1084" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI1_CLK_STATUS" acronym="MSS_RCM_MCSPI1_CLK_STATUS" offset="1088" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI2_CLK_STATUS" acronym="MSS_RCM_MCSPI2_CLK_STATUS" offset="1092" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI3_CLK_STATUS" acronym="MSS_RCM_MCSPI3_CLK_STATUS" offset="1096" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI4_CLK_STATUS" acronym="MSS_RCM_MCSPI4_CLK_STATUS" offset="1100" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI4_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI4_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MMC0_CLK_STATUS" acronym="MSS_RCM_MMC0_CLK_STATUS" offset="1104" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MMC0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for MMCSD" range="15:8" rwaccess="R"/>
	<bitfield id="MMC0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for MMCSD based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_PRU_ICSS0_UART_CLK_STATUS" acronym="MSS_RCM_PRU_ICSS0_UART_CLK_STATUS" offset="1108" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="PRU_ICSS0_UART_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for ICSSM_UCLK" range="15:8" rwaccess="R"/>
	<bitfield id="PRU_ICSS0_UART_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for ICSSM_UCLK based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_CPTS_CLK_STATUS" acronym="MSS_RCM_CPTS_CLK_STATUS" offset="1112" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="CPTS_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CPTS" range="15:8" rwaccess="R"/>
	<bitfield id="CPTS_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CPTS based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_CONTROLSS_PLL_CLK_STATUS" acronym="MSS_RCM_CONTROLSS_PLL_CLK_STATUS" offset="1120" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="CONTROLSS_PLL_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CONTROLSS_PLL" range="15:8" rwaccess="R"/>
	<bitfield id="CONTROLSS_PLL_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CONTROLSS_PLL based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_I2C_CLK_STATUS" acronym="MSS_RCM_I2C_CLK_STATUS" offset="1124" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="I2C_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for I2C" range="15:8" rwaccess="R"/>
	<bitfield id="I2C_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for I2C based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_LIN0_UART0_CLK_STATUS" acronym="MSS_RCM_LIN0_UART0_CLK_STATUS" offset="1140" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="LIN0_UART0_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="LIN0_UART0_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_LIN1_UART1_CLK_STATUS" acronym="MSS_RCM_LIN1_UART1_CLK_STATUS" offset="1144" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="LIN1_UART1_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="LIN1_UART1_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_LIN2_UART2_CLK_STATUS" acronym="MSS_RCM_LIN2_UART2_CLK_STATUS" offset="1148" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="LIN2_UART2_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="LIN2_UART2_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_LIN3_UART3_CLK_STATUS" acronym="MSS_RCM_LIN3_UART3_CLK_STATUS" offset="1152" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="LIN3_UART3_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="LIN3_UART3_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_LIN4_UART4_CLK_STATUS" acronym="MSS_RCM_LIN4_UART4_CLK_STATUS" offset="1156" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="LIN4_UART4_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="LIN4_UART4_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_LIN5_UART5_CLK_STATUS" acronym="MSS_RCM_LIN5_UART5_CLK_STATUS" offset="1160" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="LIN5_UART5_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15:8" rwaccess="R"/>
	<bitfield id="LIN5_UART5_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RGMII_250_CLK_STATUS" acronym="MSS_RCM_RGMII_250_CLK_STATUS" offset="1164" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RGMII_250_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x1" description="Status shows the current divider value choosen for RGMII" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_RGMII_50_CLK_STATUS" acronym="MSS_RCM_RGMII_50_CLK_STATUS" offset="1168" width="32" description="RGMII_50_CLK_STATUS.">
		<bitfield id="RGMII_50_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x9" description="Status shows the current divider value choosen for MII100" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_RGMII_5_CLK_STATUS" acronym="MSS_RCM_RGMII_5_CLK_STATUS" offset="1172" width="32" description="RGMII_5_CLK_STATUS.">
		<bitfield id="RGMII_5_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x99" description="Status shows the current divider value choosen for MII10" range="15:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MMC0_32K_CLK_STATUS" acronym="MSS_RCM_MMC0_32K_CLK_STATUS" offset="1180" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MMC0_32K_CLK_STATUS_CURRDIVIDER" width="10" begin="17" end="8" resetval="0x780" description="Status shows the current divider value choosen for XTAL_32K" range="17:8" rwaccess="R"/>
	</register><register id="MSS_RCM_TEMPSENSE_32K_CLK_STATUS" acronym="MSS_RCM_TEMPSENSE_32K_CLK_STATUS" offset="1184" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="TEMPSENSE_32K_CLK_STATUS_CURRDIVIDER" width="10" begin="17" end="8" resetval="0x780" description="Status shows the current divider value choosen for XTAL_32K" range="17:8" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN4_CLK_STATUS" acronym="MSS_RCM_MCAN4_CLK_STATUS" offset="1192" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN4_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN4_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN5_CLK_STATUS" acronym="MSS_RCM_MCAN5_CLK_STATUS" offset="1196" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN5_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN5_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN6_CLK_STATUS" acronym="MSS_RCM_MCAN6_CLK_STATUS" offset="1200" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN6_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN6_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCAN7_CLK_STATUS" acronym="MSS_RCM_MCAN7_CLK_STATUS" offset="1204" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCAN7_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15:8" rwaccess="R"/>
	<bitfield id="MCAN7_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI4_CLK_STATUS" acronym="MSS_RCM_RTI4_CLK_STATUS" offset="1208" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI4_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI4_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI5_CLK_STATUS" acronym="MSS_RCM_RTI5_CLK_STATUS" offset="1212" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI5_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI5_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI6_CLK_STATUS" acronym="MSS_RCM_RTI6_CLK_STATUS" offset="1216" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI6_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI6_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_RTI7_CLK_STATUS" acronym="MSS_RCM_RTI7_CLK_STATUS" offset="1220" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="RTI7_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15:8" rwaccess="R"/>
	<bitfield id="RTI7_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI5_CLK_STATUS" acronym="MSS_RCM_MCSPI5_CLK_STATUS" offset="1224" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI5_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI5_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI6_CLK_STATUS" acronym="MSS_RCM_MCSPI6_CLK_STATUS" offset="1228" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI6_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI6_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI7_CLK_STATUS" acronym="MSS_RCM_MCSPI7_CLK_STATUS" offset="1232" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="MCSPI7_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15:8" rwaccess="R"/>
	<bitfield id="MCSPI7_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_R5SS0_POR_RST_CTRL" acronym="MSS_RCM_R5SS0_POR_RST_CTRL" offset="1280" width="32" description="R5SS POR Reset.">
		<bitfield id="R5SS0_POR_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111 will assert por reset to R5SS Read is always 000" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_POR_RST_CTRL" acronym="MSS_RCM_R5SS1_POR_RST_CTRL" offset="1284" width="32" description="R5SS POR Reset.">
		<bitfield id="R5SS1_POR_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111 will assert por reset to R5SS Read is always 000" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_CORE0_GRST_CTRL" acronym="MSS_RCM_R5SS0_CORE0_GRST_CTRL" offset="1288" width="32" description="Core 0 Global Reset.">
		<bitfield id="R5SS0_CORE0_GRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 and MSS_CORE0_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_CORE0_GRST_CTRL" acronym="MSS_RCM_R5SS1_CORE0_GRST_CTRL" offset="1292" width="32" description="Core 0 Global Reset.">
		<bitfield id="R5SS1_CORE0_GRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 and MSS_CORE0_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_CORE1_GRST_CTRL" acronym="MSS_RCM_R5SS0_CORE1_GRST_CTRL" offset="1296" width="32" description="Core 1 Global Reset.">
		<bitfield id="R5SS0_CORE1_GRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1  and MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_CORE1_GRST_CTRL" acronym="MSS_RCM_R5SS1_CORE1_GRST_CTRL" offset="1300" width="32" description="Core 1 Global Reset.">
		<bitfield id="R5SS1_CORE1_GRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1  and MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_CORE0_LRST_CTRL" acronym="MSS_RCM_R5SS0_CORE0_LRST_CTRL" offset="1304" width="32" description="Core 0 Local  Reset.">
		<bitfield id="R5SS0_CORE0_LRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_CORE0_LRST_CTRL" acronym="MSS_RCM_R5SS1_CORE0_LRST_CTRL" offset="1308" width="32" description="Core 0 Local  Reset.">
		<bitfield id="R5SS1_CORE0_LRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE0 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_CORE1_LRST_CTRL" acronym="MSS_RCM_R5SS0_CORE1_LRST_CTRL" offset="1312" width="32" description="Core 1 Local  Reset.">
