ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="R5SS0_CORE1_LRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_CORE1_LRST_CTRL" acronym="MSS_RCM_R5SS1_CORE1_LRST_CTRL" offset="1316" width="32" description="Core 1 Local  Reset.">
		<bitfield id="R5SS1_CORE1_LRST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:Writing 3'b111  will reset CORE1 only" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_VIM0_RST_CTRL" acronym="MSS_RCM_R5SS0_VIM0_RST_CTRL" offset="1320" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="R5SS0_VIM0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE0_VIM Writing 3'b000 will deassert the reset" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_VIM0_RST_CTRL" acronym="MSS_RCM_R5SS1_VIM0_RST_CTRL" offset="1324" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="R5SS1_VIM0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE0_VIM Writing 3'b000 will deassert the reset" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS0_VIM1_RST_CTRL" acronym="MSS_RCM_R5SS0_VIM1_RST_CTRL" offset="1328" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="R5SS0_VIM1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_R5SS1_VIM1_RST_CTRL" acronym="MSS_RCM_R5SS1_VIM1_RST_CTRL" offset="1332" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="R5SS1_VIM1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_CORE1_VIM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCRC0_RST_CTRL" acronym="MSS_RCM_MCRC0_RST_CTRL" offset="1336" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCRC0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MCRC" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI0_RST_CTRL" acronym="MSS_RCM_RTI0_RST_CTRL" offset="1340" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI1_RST_CTRL" acronym="MSS_RCM_RTI1_RST_CTRL" offset="1344" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI2_RST_CTRL" acronym="MSS_RCM_RTI2_RST_CTRL" offset="1348" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI3_RST_CTRL" acronym="MSS_RCM_RTI3_RST_CTRL" offset="1352" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT0_RST_CTRL" acronym="MSS_RCM_WDT0_RST_CTRL" offset="1356" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="WDT0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT1_RST_CTRL" acronym="MSS_RCM_WDT1_RST_CTRL" offset="1360" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="WDT1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT2_RST_CTRL" acronym="MSS_RCM_WDT2_RST_CTRL" offset="1364" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="WDT2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_WDT3_RST_CTRL" acronym="MSS_RCM_WDT3_RST_CTRL" offset="1368" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="WDT3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_TOP_ESM_RST_CTRL" acronym="MSS_RCM_TOP_ESM_RST_CTRL" offset="1372" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="TOP_ESM_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset ESM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_DCC0_RST_CTRL" acronym="MSS_RCM_DCC0_RST_CTRL" offset="1376" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="DCC0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC0" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_DCC1_RST_CTRL" acronym="MSS_RCM_DCC1_RST_CTRL" offset="1380" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="DCC1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC1" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_DCC2_RST_CTRL" acronym="MSS_RCM_DCC2_RST_CTRL" offset="1384" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="DCC2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC2" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_DCC3_RST_CTRL" acronym="MSS_RCM_DCC3_RST_CTRL" offset="1388" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="DCC3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset DCC3" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI0_RST_CTRL" acronym="MSS_RCM_MCSPI0_RST_CTRL" offset="1392" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI1_RST_CTRL" acronym="MSS_RCM_MCSPI1_RST_CTRL" offset="1396" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI2_RST_CTRL" acronym="MSS_RCM_MCSPI2_RST_CTRL" offset="1400" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI3_RST_CTRL" acronym="MSS_RCM_MCSPI3_RST_CTRL" offset="1404" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI4_RST_CTRL" acronym="MSS_RCM_MCSPI4_RST_CTRL" offset="1408" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_OSPI0_RST_CTRL" acronym="MSS_RCM_OSPI0_RST_CTRL" offset="1412" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="OSPI0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset OSPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN0_RST_CTRL" acronym="MSS_RCM_MCAN0_RST_CTRL" offset="1416" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN1_RST_CTRL" acronym="MSS_RCM_MCAN1_RST_CTRL" offset="1420" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN2_RST_CTRL" acronym="MSS_RCM_MCAN2_RST_CTRL" offset="1424" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN3_RST_CTRL" acronym="MSS_RCM_MCAN3_RST_CTRL" offset="1428" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C0_RST_CTRL" acronym="MSS_RCM_I2C0_RST_CTRL" offset="1432" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="I2C0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C1_RST_CTRL" acronym="MSS_RCM_I2C1_RST_CTRL" offset="1436" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="I2C1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C2_RST_CTRL" acronym="MSS_RCM_I2C2_RST_CTRL" offset="1440" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="I2C2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_I2C3_RST_CTRL" acronym="MSS_RCM_I2C3_RST_CTRL" offset="1444" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="I2C3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding I2C" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART0_RST_CTRL" acronym="MSS_RCM_UART0_RST_CTRL" offset="1448" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="UART0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART1_RST_CTRL" acronym="MSS_RCM_UART1_RST_CTRL" offset="1452" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="UART1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART2_RST_CTRL" acronym="MSS_RCM_UART2_RST_CTRL" offset="1456" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="UART2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART3_RST_CTRL" acronym="MSS_RCM_UART3_RST_CTRL" offset="1460" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="UART3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART4_RST_CTRL" acronym="MSS_RCM_UART4_RST_CTRL" offset="1464" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="UART4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_UART5_RST_CTRL" acronym="MSS_RCM_UART5_RST_CTRL" offset="1468" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="UART5_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding UART instance" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN0_RST_CTRL" acronym="MSS_RCM_LIN0_RST_CTRL" offset="1472" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="LIN0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN1_RST_CTRL" acronym="MSS_RCM_LIN1_RST_CTRL" offset="1476" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="LIN1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN2_RST_CTRL" acronym="MSS_RCM_LIN2_RST_CTRL" offset="1480" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="LIN2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN3_RST_CTRL" acronym="MSS_RCM_LIN3_RST_CTRL" offset="1484" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="LIN3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LIN4_RST_CTRL" acronym="MSS_RCM_LIN4_RST_CTRL" offset="1488" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="LIN4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset LIN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_EDMA_RST_CTRL" acronym="MSS_RCM_EDMA_RST_CTRL" offset="1496" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="EDMA_RST_CTRL_TPTCA1_ASSERT" width="3" begin="14" end="12" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_TPTCA1" range="14:12" rwaccess="R/W"/>
	<bitfield id="EDMA_RST_CTRL_TPTCA0_ASSERT" width="3" begin="10" end="8" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_TPTCA0" range="10:8" rwaccess="R/W"/>
	<bitfield id="EDMA_RST_CTRL_TPCCA_ASSERT" width="3" begin="6" end="4" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS_TPCCA" range="6:4" rwaccess="R/W"/>
	<bitfield id="EDMA_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset EDMA" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_INFRA_RST_CTRL" acronym="MSS_RCM_INFRA_RST_CTRL" offset="1500" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="INFRA_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS INFRA" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_CPSW_RST_CTRL" acronym="MSS_RCM_CPSW_RST_CTRL" offset="1504" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="CPSW_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS CPSW" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_PRU_ICSS0_RST_CTRL" acronym="MSS_RCM_PRU_ICSS0_RST_CTRL" offset="1508" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="PRU_ICSS0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MSS ICSSM" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MMC0_RST_CTRL" acronym="MSS_RCM_MMC0_RST_CTRL" offset="1512" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MMC0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset MMCSD" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPIO0_RST_CTRL" acronym="MSS_RCM_GPIO0_RST_CTRL" offset="1516" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="GPIO0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding GPIO" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPIO1_RST_CTRL" acronym="MSS_RCM_GPIO1_RST_CTRL" offset="1520" width="32" description="This register is used to Reset respective IP.">
