ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
		<bitfield id="GPIO1_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding GPIO" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPIO2_RST_CTRL" acronym="MSS_RCM_GPIO2_RST_CTRL" offset="1524" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="GPIO2_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding GPIO" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_GPIO3_RST_CTRL" acronym="MSS_RCM_GPIO3_RST_CTRL" offset="1528" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="GPIO3_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding GPIO" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_SPINLOCK0_RST_CTRL" acronym="MSS_RCM_SPINLOCK0_RST_CTRL" offset="1532" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="SPINLOCK0_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset SPINLOCK" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_TEMPSENSE_32K_RST_CTRL" acronym="MSS_RCM_TEMPSENSE_32K_RST_CTRL" offset="1540" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="TEMPSENSE_32K_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset TEMPSENSE**Note: This bit will only be reset by PORz." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN4_RST_CTRL" acronym="MSS_RCM_MCAN4_RST_CTRL" offset="1548" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN5_RST_CTRL" acronym="MSS_RCM_MCAN5_RST_CTRL" offset="1552" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN5_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN6_RST_CTRL" acronym="MSS_RCM_MCAN6_RST_CTRL" offset="1556" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN6_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCAN7_RST_CTRL" acronym="MSS_RCM_MCAN7_RST_CTRL" offset="1560" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCAN7_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding MCAN" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI4_RST_CTRL" acronym="MSS_RCM_RTI4_RST_CTRL" offset="1564" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI4_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI5_RST_CTRL" acronym="MSS_RCM_RTI5_RST_CTRL" offset="1568" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI5_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI6_RST_CTRL" acronym="MSS_RCM_RTI6_RST_CTRL" offset="1572" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI6_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_RTI7_RST_CTRL" acronym="MSS_RCM_RTI7_RST_CTRL" offset="1576" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="RTI7_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset corresponding RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI5_RST_CTRL" acronym="MSS_RCM_MCSPI5_RST_CTRL" offset="1580" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI5_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI6_RST_CTRL" acronym="MSS_RCM_MCSPI6_RST_CTRL" offset="1584" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI6_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI7_RST_CTRL" acronym="MSS_RCM_MCSPI7_RST_CTRL" offset="1588" width="32" description="This register is used to Reset respective IP.">
		<bitfield id="MCSPI7_RST_CTRL_ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  3'b111  will reset Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_L2_BANK0_PD_CTRL" acronym="MSS_RCM_MSS_L2_BANK0_PD_CTRL" offset="1792" width="32" description="S/W control to Powers down the L2 Bank 0 and disconnect from Interconnect. AON AGOOD 0 or ISO =1 causes bus disconnect.">
		<bitfield id="MSS_L2_BANK0_PD_CTRL_AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANK0" range="10:8" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK0_PD_CTRL_AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANK0" range="6:4" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK0_PD_CTRL_ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANK0." range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_L2_BANK1_PD_CTRL" acronym="MSS_RCM_MSS_L2_BANK1_PD_CTRL" offset="1796" width="32" description="S/W control to Powers down the L2 Bank 1 and disconnect from Interconnect.">
		<bitfield id="MSS_L2_BANK1_PD_CTRL_AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANK1" range="10:8" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK1_PD_CTRL_AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANK1" range="6:4" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK1_PD_CTRL_ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANK1" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_L2_BANK2_PD_CTRL" acronym="MSS_RCM_MSS_L2_BANK2_PD_CTRL" offset="1800" width="32" description="S/W control to Powers down the L2 Bank 2 and disconnect from Interconnect.">
		<bitfield id="MSS_L2_BANK2_PD_CTRL_AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANK2" range="10:8" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK2_PD_CTRL_AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANK2" range="6:4" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK2_PD_CTRL_ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANK2" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_L2_BANK3_PD_CTRL" acronym="MSS_RCM_MSS_L2_BANK3_PD_CTRL" offset="1804" width="32" description="S/W control to Powers down the L2 Bank 3 and disconnect from Interconnect.">
		<bitfield id="MSS_L2_BANK3_PD_CTRL_AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANK3" range="10:8" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK3_PD_CTRL_AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANK3" range="6:4" rwaccess="R/W"/>
	<bitfield id="MSS_L2_BANK3_PD_CTRL_ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANK3" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MSS_L2_BANK0_PD_STATUS" acronym="MSS_RCM_MSS_L2_BANK0_PD_STATUS" offset="1808" width="32" description="L2 Bank PD status. Pgood out observation.">
		<bitfield id="MSS_L2_BANK0_PD_STATUS_AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANK0" range="1" rwaccess="R"/>
	<bitfield id="MSS_L2_BANK0_PD_STATUS_AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANK0" range="0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_L2_BANK1_PD_STATUS" acronym="MSS_RCM_MSS_L2_BANK1_PD_STATUS" offset="1812" width="32" description="L2 Bank PD status. Pgood out observation.">
		<bitfield id="MSS_L2_BANK1_PD_STATUS_AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANK1" range="1" rwaccess="R"/>
	<bitfield id="MSS_L2_BANK1_PD_STATUS_AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANK1" range="0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_L2_BANK2_PD_STATUS" acronym="MSS_RCM_MSS_L2_BANK2_PD_STATUS" offset="1816" width="32" description="L2 Bank PD status. Pgood out observation.">
		<bitfield id="MSS_L2_BANK2_PD_STATUS_AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANK2" range="1" rwaccess="R"/>
	<bitfield id="MSS_L2_BANK2_PD_STATUS_AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANK2" range="0" rwaccess="R"/>
	</register><register id="MSS_RCM_MSS_L2_BANK3_PD_STATUS" acronym="MSS_RCM_MSS_L2_BANK3_PD_STATUS" offset="1820" width="32" description="L2 Bank PD status. Pgood out observation.">
		<bitfield id="MSS_L2_BANK3_PD_STATUS_AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANK3" range="1" rwaccess="R"/>
	<bitfield id="MSS_L2_BANK3_PD_STATUS_AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANK3" range="0" rwaccess="R"/>
	</register><register id="MSS_RCM_L2OCRAM_BANK4_PD_CTRL" acronym="MSS_RCM_L2OCRAM_BANK4_PD_CTRL" offset="1840" width="32" description="S/W control to Powers down the L2 Bank 4 and disconnect from Interconnect.">
		<bitfield id="L2OCRAM_BANK4_PD_CTRL_AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANKE" range="10:8" rwaccess="R/W"/>
	<bitfield id="L2OCRAM_BANK4_PD_CTRL_AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANKE" range="6:4" rwaccess="R/W"/>
	<bitfield id="L2OCRAM_BANK4_PD_CTRL_ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANKE" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_L2OCRAM_BANK5_PD_CTRL" acronym="MSS_RCM_L2OCRAM_BANK5_PD_CTRL" offset="1844" width="32" description="S/W control to Powers down the L2 Bank 5 and disconnect from Interconnect.">
		<bitfield id="L2OCRAM_BANK5_PD_CTRL_AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANKF" range="10:8" rwaccess="R/W"/>
	<bitfield id="L2OCRAM_BANK5_PD_CTRL_AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANKF" range="6:4" rwaccess="R/W"/>
	<bitfield id="L2OCRAM_BANK5_PD_CTRL_ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANKF" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_L2OCRAM_BANK4_PD_STATUS" acronym="MSS_RCM_L2OCRAM_BANK4_PD_STATUS" offset="1848" width="32" description="L2 Bank PD status. Pgood out observation.">
		<bitfield id="L2OCRAM_BANK4_PD_STATUS_AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANKE" range="1" rwaccess="R"/>
	<bitfield id="L2OCRAM_BANK4_PD_STATUS_AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANKE" range="0" rwaccess="R"/>
	</register><register id="MSS_RCM_L2OCRAM_BANK5_PD_STATUS" acronym="MSS_RCM_L2OCRAM_BANK5_PD_STATUS" offset="1852" width="32" description="L2 Bank PD status. Pgood out observation.">
		<bitfield id="L2OCRAM_BANK5_PD_STATUS_AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANKF" range="1" rwaccess="R"/>
	<bitfield id="L2OCRAM_BANK5_PD_STATUS_AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANKF" range="0" rwaccess="R"/>
	</register><register id="MSS_RCM_HSM_RTIA_CLK_SRC_SEL" acronym="MSS_RCM_HSM_RTIA_CLK_SRC_SEL" offset="2048" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="HSM_RTIA_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  XTALCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  RCCLK10M0x555 -  RCCLK10M0x666 -  EXT_REFCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_WDT_CLK_SRC_SEL" acronym="MSS_RCM_HSM_WDT_CLK_SRC_SEL" offset="2052" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="HSM_WDT_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x1365" description="Select line for selecting source clock for HSM_WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  XTALCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  RCCLK10M0x555 -  RCCLK10M0x666 -  EXT_REFCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_RTC_CLK_SRC_SEL" acronym="MSS_RCM_HSM_RTC_CLK_SRC_SEL" offset="2056" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="HSM_RTC_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x1911" description="Select line for selecting source clock for HSM_RTC.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  XTALCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  RCCLK10M0x555 -  RCCLK10M0x666 -  EXT_REFCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_DMTA_CLK_SRC_SEL" acronym="MSS_RCM_HSM_DMTA_CLK_SRC_SEL" offset="2060" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="HSM_DMTA_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_DMTA.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  XTALCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  RCCLK10M0x555 -  RCCLK10M0x666 -  EXT_REFCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_DMTB_CLK_SRC_SEL" acronym="MSS_RCM_HSM_DMTB_CLK_SRC_SEL" offset="2064" width="32" description="This Register is used for selecting the clock source for Corresponding root clock.">
		<bitfield id="HSM_DMTB_CLK_SRC_SEL_CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_DMTB.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Use the following values to select clk src-0x000 -  WUCPUCLK0x111 -  XTALCLK0x222 -  SYS_CLK0x333 -  DPLL_PER_HSDIV0_CLKOUT10x444 -  RCCLK10M0x555 -  RCCLK10M0x666 -  EXT_REFCLK0x777 -  RCCLK32K" range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_RTI_CLK_DIV_VAL" acronym="MSS_RCM_HSM_RTI_CLK_DIV_VAL" offset="2068" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="HSM_RTI_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM RTI selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_WDT_CLK_DIV_VAL" acronym="MSS_RCM_HSM_WDT_CLK_DIV_VAL" offset="2072" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="HSM_WDT_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM WDT selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_RTC_CLK_DIV_VAL" acronym="MSS_RCM_HSM_RTC_CLK_DIV_VAL" offset="2076" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="HSM_RTC_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM RTC selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_DMTA_CLK_DIV_VAL" acronym="MSS_RCM_HSM_DMTA_CLK_DIV_VAL" offset="2080" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="HSM_DMTA_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM DMTA selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_DMTB_CLK_DIV_VAL" acronym="MSS_RCM_HSM_DMTB_CLK_DIV_VAL" offset="2084" width="32" description="This Register is used to select the Divider value for respective clk.">
		<bitfield id="HSM_DMTB_CLK_DIV_VAL_CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM DMTB selected clock.To set the divider value of [n+1] configure the register to value of '0xnnn'.Data should be loaded as multibit.  For example:  if divider value of '0x9' is required then '0x888' should be configured to the register." range="11:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_RTI_CLK_GATE" acronym="MSS_RCM_HSM_RTI_CLK_GATE" offset="2088" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="HSM_RTI_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for HSM RTI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_WDT_CLK_GATE" acronym="MSS_RCM_HSM_WDT_CLK_GATE" offset="2092" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="HSM_WDT_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x7" description="Writing 3'b111  will gate clock for HSM WDT" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_RTC_CLK_GATE" acronym="MSS_RCM_HSM_RTC_CLK_GATE" offset="2096" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="HSM_RTC_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for HSM RTC" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_DMTA_CLK_GATE" acronym="MSS_RCM_HSM_DMTA_CLK_GATE" offset="2100" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="HSM_DMTA_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for HSM DMTA" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_DMTB_CLK_GATE" acronym="MSS_RCM_HSM_DMTB_CLK_GATE" offset="2104" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="HSM_DMTB_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for HSM DMTB" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_HSM_RTI_CLK_STATUS" acronym="MSS_RCM_HSM_RTI_CLK_STATUS" offset="2108" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="HSM_RTI_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_RTI" range="15:8" rwaccess="R"/>
