ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/MSS_RCM_MSS_RCM_53208000h.xml
	<bitfield id="HSM_RTI_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_RTI based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_HSM_WDT_CLK_STATUS" acronym="MSS_RCM_HSM_WDT_CLK_STATUS" offset="2112" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="HSM_WDT_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_WDT" range="15:8" rwaccess="R"/>
	<bitfield id="HSM_WDT_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x32" description="Status shows the source clock slected for HSM_WDT based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_HSM_RTC_CLK_STATUS" acronym="MSS_RCM_HSM_RTC_CLK_STATUS" offset="2116" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="HSM_RTC_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_RTC" range="15:8" rwaccess="R"/>
	<bitfield id="HSM_RTC_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x128" description="Status shows the source clock slected for HSM_RTC based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_HSM_DMTA_CLK_STATUS" acronym="MSS_RCM_HSM_DMTA_CLK_STATUS" offset="2120" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="HSM_DMTA_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_DMTA" range="15:8" rwaccess="R"/>
	<bitfield id="HSM_DMTA_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_DMTA based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_HSM_DMTB_CLK_STATUS" acronym="MSS_RCM_HSM_DMTB_CLK_STATUS" offset="2124" width="32" description="Clock source selection and Divider Value  of respective clock.">
		<bitfield id="HSM_DMTB_CLK_STATUS_CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_DMTB" range="15:8" rwaccess="R"/>
	<bitfield id="HSM_DMTB_CLK_STATUS_CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_DMTB based on one hot encoding technique." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_MCSPI5_CLK_GATE" acronym="MSS_RCM_MCSPI5_CLK_GATE" offset="2304" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI5_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI6_CLK_GATE" acronym="MSS_RCM_MCSPI6_CLK_GATE" offset="2308" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI6_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_MCSPI7_CLK_GATE" acronym="MSS_RCM_MCSPI7_CLK_GATE" offset="2312" width="32" description="This Register is used to enable clk gating for the respective clk.">
		<bitfield id="MCSPI7_CLK_GATE_GATED" width="3" begin="2" end="0" resetval="0x0" description="Writing 3'b111  will gate clock for Corresponding SPI" range="2:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LOCK0_KICK0" acronym="MSS_RCM_LOCK0_KICK0" offset="4104" width="32" description=" - KICK0 component.">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description=" - KICK0 component" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_LOCK0_KICK1" acronym="MSS_RCM_LOCK0_KICK1" offset="4108" width="32" description=" - KICK1 component.">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description=" - KICK1 component" range="31:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_INTR_RAW_STATUS" acronym="MSS_RCM_INTR_RAW_STATUS" offset="4112" width="32" description="Interrupt Raw Status/Set Register.">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="MSS_RCM_INTR_ENABLED_STATUS_CLEAR" acronym="MSS_RCM_INTR_ENABLED_STATUS_CLEAR" offset="4116" width="32" description="Interrupt Enabled Status/Clear register.">
		<bitfield id="ENABLED_PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="MSS_RCM_INTR_ENABLE" acronym="MSS_RCM_INTR_ENABLE" offset="4120" width="32" description="Interrupt Enable register.">
		<bitfield id="PROXY_ERR_EN" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TS"/>
	<bitfield id="KICK_ERR_EN" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TS"/>
	<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TS"/>
	</register><register id="MSS_RCM_INTR_ENABLE_CLEAR" acronym="MSS_RCM_INTR_ENABLE_CLEAR" offset="4124" width="32" description="Interrupt Enable Clear register.">
		<bitfield id="PROXY_ERR_EN_CLR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="3" rwaccess="R/W1TC"/>
	<bitfield id="KICK_ERR_EN_CLR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="2" rwaccess="R/W1TC"/>
	<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="R/W1TC"/>
	<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register><register id="MSS_RCM_EOI" acronym="MSS_RCM_EOI" offset="4128" width="32" description="EOI register.">
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value. Write this with interrupt distribution value in the chip." range="7:0" rwaccess="R/W"/>
	</register><register id="MSS_RCM_FAULT_ADDRESS" acronym="MSS_RCM_FAULT_ADDRESS" offset="4132" width="32" description="Fault Address register.">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault Address." range="31:0" rwaccess="R"/>
	</register><register id="MSS_RCM_FAULT_TYPE_STATUS" acronym="MSS_RCM_FAULT_TYPE_STATUS" offset="4136" width="32" description="Fault Type Status register.">
		<bitfield id="FAULT_NS" width="1" begin="6" end="6" resetval="0x0" description="Non-secure access." range="6" rwaccess="R"/>
	<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault Type  10_0000 = Supervisor read  fault  - priv = 1 dir = 1 dtype != 1   01_0000 = Supervisor write fault  - priv = 1 dir = 0  00_1000 = Supervisor execute fault - priv = 1 dir = 1 dtype = 1  00_0100 = User read  fault - priv = 0 dir = 1 dtype = 1  00_0010 = User write fault - priv = 0 dir = 0  00_0001 = User execute fault - priv = 0 dir = 1 dtype = 1  00_0000 = No fault" range="5:0" rwaccess="R"/>
	</register><register id="MSS_RCM_FAULT_ATTR_STATUS" acronym="MSS_RCM_FAULT_ATTR_STATUS" offset="4140" width="32" description="Fault Attribute Status register.">
		<bitfield id="FAULT_XID" width="12" begin="31" end="20" resetval="0x0" description="XID." range="31:20" rwaccess="R"/>
	<bitfield id="FAULT_ROUTEID" width="12" begin="19" end="8" resetval="0x0" description="Route ID." range="19:8" rwaccess="R"/>
	<bitfield id="FAULT_PRIVID" width="8" begin="7" end="0" resetval="0x0" description="Privilege ID." range="7:0" rwaccess="R"/>
	</register><register id="MSS_RCM_FAULT_CLEAR" acronym="MSS_RCM_FAULT_CLEAR" offset="4144" width="32" description="Fault Clear register.">
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="W"/>
	</register>
</module>